ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_LPC546XX/drivers/fsl_clock.h
/*! @brief PLL status definitions
 */
typedef enum _pll_error {
    kStatus_PLL_Success = MAKE_STATUS(kStatusGroup_Generic, 0),         /*!< PLL operation was successful */
    kStatus_PLL_OutputTooLow = MAKE_STATUS(kStatusGroup_Generic, 1),    /*!< PLL output rate request was too low */
    kStatus_PLL_OutputTooHigh = MAKE_STATUS(kStatusGroup_Generic, 2),   /*!< PLL output rate request was too high */
    kStatus_PLL_InputTooLow = MAKE_STATUS(kStatusGroup_Generic, 3),     /*!< PLL input rate is too low */
    kStatus_PLL_InputTooHigh = MAKE_STATUS(kStatusGroup_Generic, 4),    /*!< PLL input rate is too high */
    kStatus_PLL_OutsideIntLimit = MAKE_STATUS(kStatusGroup_Generic, 5), /*!< Requested output rate isn't possible */
    kStatus_PLL_CCOTooLow = MAKE_STATUS(kStatusGroup_Generic, 6),       /*!< Requested CCO rate isn't possible */
    kStatus_PLL_CCOTooHigh = MAKE_STATUS(kStatusGroup_Generic, 7)       /*!< Requested CCO rate isn't possible */
} pll_error_t;

/*! @brief USB clock source definition. */
typedef enum _clock_usb_src {
    kCLOCK_UsbSrcFro = (uint32_t)kCLOCK_FroHf,            /*!< Use FRO 96 or 48 MHz. */
    kCLOCK_UsbSrcSystemPll = (uint32_t)kCLOCK_PllOut,     /*!< Use System PLL output. */
    kCLOCK_UsbSrcMainClock = (uint32_t)kCLOCK_CoreSysClk, /*!< Use Main clock.    */
    kCLOCK_UsbSrcUsbPll = (uint32_t)kCLOCK_UsbPll,        /*!< Use USB PLL clock.    */

    kCLOCK_UsbSrcNone = SYSCON_USB0CLKSEL_SEL(7)          /*!< Use None, this may be selected in order to reduce power when no output is needed.. */
} clock_usb_src_t;

/*! @brief USB PDEL Divider. */
typedef enum _usb_pll_psel {
    pSel_Divide_1 = 0U,
    pSel_Divide_2,
    pSel_Divide_4,
    pSel_Divide_8
} usb_pll_psel;

/*! @brief PLL setup structure
* This structure can be used to pre-build a USB PLL setup configuration
* at run-time and quickly set the usb PLL to the configuration. It can be
* populated with the USB PLL setup function. If powering up or waiting
* for USB PLL lock, the PLL input clock source should be configured prior
* to USB PLL setup.
*/
typedef struct _usb_pll_setup {
    uint8_t msel;           /*!< USB PLL control register msel:1U-256U */
    uint8_t psel;           /*!< USB PLL control register psel:only support inter 1U 2U 4U 8U */
    uint8_t nsel;           /*!< USB PLL control register nsel:only suppoet inter 1U 2U 3U 4U */
    bool direct;            /*!< USB PLL CCO output control */
    bool bypass;            /*!< USB PLL inout clock bypass control  */
    bool fbsel;             /*!< USB PLL ineter mode and non-integer mode control*/
    uint32_t inputRate;     /*!< USB PLL input rate */
} usb_pll_setup_t;

/*! @brief  Return System PLL output clock rate from setup structure
 *  @param  pSetup  : Pointer to a PLL setup structure
 *  @return System PLL output clock rate the setup structure will generate
 */
uint32_t CLOCK_GetSystemPLLOutFromSetup(pll_setup_t *pSetup);

/*! @brief  Return System AUDIO PLL output clock rate from setup structure
 *  @param  pSetup  : Pointer to a PLL setup structure
 *  @return System PLL output clock rate the setup structure will generate
 */
uint32_t CLOCK_GetAudioPLLOutFromSetup(pll_setup_t *pSetup);

/*! @brief  Return System USB PLL output clock rate from setup structure
 *  @param  pSetup  : Pointer to a PLL setup structure
 *  @return System PLL output clock rate the setup structure will generate
 */
uint32_t CLOCK_GetUsbPLLOutFromSetup(const usb_pll_setup_t *pSetup);

/*! @brief  Set PLL output based on the passed PLL setup data
 *  @param  pControl    : Pointer to populated PLL control structure to generate setup with
 *  @param  pSetup      : Pointer to PLL setup structure to be filled
 *  @return PLL_ERROR_SUCCESS on success, or PLL setup error code
 *  @note   Actual frequency for setup may vary from the desired frequency based on the
 *  accuracy of input clocks, rounding, non-fractional PLL mode, etc.
 */
pll_error_t CLOCK_SetupPLLData(pll_config_t *pControl, pll_setup_t *pSetup);

/*! @brief  Set AUDIO PLL output based on the passed AUDIO PLL setup data
 *  @param  pControl    : Pointer to populated PLL control structure to generate setup with
 *  @param  pSetup      : Pointer to PLL setup structure to be filled
 *  @return PLL_ERROR_SUCCESS on success, or PLL setup error code
 *  @note   Actual frequency for setup may vary from the desired frequency based on the
 *  accuracy of input clocks, rounding, non-fractional PLL mode, etc.
 */
pll_error_t CLOCK_SetupAudioPLLData(pll_config_t *pControl, pll_setup_t *pSetup);

/*! @brief  Set PLL output from PLL setup structure (precise frequency)
 * @param   pSetup  : Pointer to populated PLL setup structure
* @param flagcfg : Flag configuration for PLL config structure
 * @return  PLL_ERROR_SUCCESS on success, or PLL setup error code
 * @note    This function will power off the PLL, setup the PLL with the
 * new setup data, and then optionally powerup the PLL, wait for PLL lock,
 * and adjust system voltages to the new PLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetupSystemPLLPrec(pll_setup_t *pSetup, uint32_t flagcfg);

/*! @brief  Set AUDIO PLL output from AUDIOPLL setup structure (precise frequency)
 * @param   pSetup  : Pointer to populated PLL setup structure
* @param flagcfg : Flag configuration for PLL config structure
 * @return  PLL_ERROR_SUCCESS on success, or PLL setup error code
 * @note    This function will power off the PLL, setup the PLL with the
 * new setup data, and then optionally powerup the AUDIO PLL, wait for PLL lock,
 * and adjust system voltages to the new AUDIOPLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the AUDIO PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetupAudioPLLPrec(pll_setup_t *pSetup, uint32_t flagcfg);

/**
 * @brief   Set PLL output from PLL setup structure (precise frequency)
 * @param   pSetup  : Pointer to populated PLL setup structure
 * @return  kStatus_PLL_Success on success, or PLL setup error code
 * @note    This function will power off the PLL, setup the PLL with the
 * new setup data, and then optionally powerup the PLL, wait for PLL lock,
 * and adjust system voltages to the new PLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetPLLFreq(const pll_setup_t *pSetup);

/**
 * @brief   Set Audio PLL output from Audio PLL setup structure (precise frequency)
 * @param   pSetup  : Pointer to populated PLL setup structure
 * @return  kStatus_PLL_Success on success, or Audio PLL setup error code
 * @note    This function will power off the PLL, setup the Audio PLL with the
 * new setup data, and then optionally powerup the PLL, wait for Audio PLL lock,
 * and adjust system voltages to the new PLL rate. The function will not
 * alter any source clocks (ie, main systen clock) that may use the Audio PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetAudioPLLFreq(const pll_setup_t *pSetup);

/**
 * @brief   Set USB PLL output from USB PLL setup structure (precise frequency)
 * @param   pSetup  : Pointer to populated USB PLL setup structure
 * @return  kStatus_PLL_Success on success, or USB PLL setup error code
 * @note    This function will power off the USB PLL, setup the PLL with the
 * new setup data, and then optionally powerup the USB PLL, wait for USB PLL lock,
 * and adjust system voltages to the new USB PLL rate. The function will not
 * alter any source clocks (ie, usb pll clock) that may use the USB PLL,
 * so these should be setup prior to and after exiting the function.
 */
pll_error_t CLOCK_SetUsbPLLFreq(const usb_pll_setup_t *pSetup);

/*! @brief  Set PLL output based on the multiplier and input frequency
 * @param   multiply_by : multiplier
 * @param   input_freq  : Clock input frequency of the PLL
 * @return  Nothing
 * @note    Unlike the Chip_Clock_SetupSystemPLLPrec() function, this
 * function does not disable or enable PLL power, wait for PLL lock,
 * or adjust system voltages. These must be done in the application.
 * The function will not alter any source clocks (ie, main systen clock)
 * that may use the PLL, so these should be setup prior to and after
 * exiting the function.
 */
void CLOCK_SetupSystemPLLMult(uint32_t multiply_by, uint32_t input_freq);

/*! @brief Disable USB clock.
 *
 * Disable USB clock.
 */
static inline void CLOCK_DisableUsbDevicefs0Clock(clock_ip_name_t clk)
{
    CLOCK_DisableClock(clk);
}

/*! @brief Enable USB Device FS clock.
 * @param   src : clock source
 * @param   freq: clock frequency
 * Enable USB Device Full Speed clock.
 */
bool CLOCK_EnableUsbfs0DeviceClock(clock_usb_src_t src, uint32_t freq);

/*! @brief Enable USB HOST FS clock.
 * @param   src : clock source
 * @param   freq: clock frequency
 * Enable USB HOST Full Speed clock.
 */
bool CLOCK_EnableUsbfs0HostClock(clock_usb_src_t src, uint32_t freq);

/*! @brief Enable USB Device HS clock.
 * @param   src : clock source
 * @param   freq: clock frequency
 * Enable USB Device High Speed clock.
 */
bool CLOCK_EnableUsbhs0DeviceClock(clock_usb_src_t src, uint32_t freq);

/*! @brief Enable USB HOST HS clock.
 * @param   src : clock source
 * @param   freq: clock frequency
 * Enable USB HOST High Speed clock.
 */
bool CLOCK_EnableUsbhs0HostClock(clock_usb_src_t src, uint32_t freq);

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* _FSL_CLOCK_H_ */
